export const COEFFICIENT = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]

export const PARITY = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2']

export const GENDER = ['F', 'M']

export const GENDER_STR = ['女', '男']

export const CONSTELLATION_DAY_LIST = [
  ['0121', '0219'],
  ['0220', '0320'],
  ['0321', '0420'],
  ['0421', '0521'],
  ['0522', '0621'],
  ['0622', '0723'],
  ['0724', '0823'],
  ['0824', '0923'],
  ['0924', '1023'],
  ['1024', '1122'],
  ['1123', '1222'],
  ['1223', '0122', true],
]

export const CONSTELLATION_LIST = [
  '水瓶',
  '双鱼',
  '白羊',
  '金牛',
  '双子',
  '巨蟹',
  '狮子',
  '处女',
  '天秤',
  '天蝎',
  '射手',
  '摩羯',
]
